# Removing duplicates

In [1]:
import numpy as np 
import pandas as pd 

from pandas import Series, DataFrame

### Genrate a dataframe to work with

In [2]:
df_obj = DataFrame(
    {
        'Name': ['Zack', 'Zack', 'Liza', 'Liza', 'John', 'John', 'John'],
        'Zip': ['06901', '06901', '10001', '10001', '50307', '50307', '50307'],
        'Number': [1, 1, 2, 2, 3, 3, 3]
    }
)
df_obj

   Name    Zip  Number
0  Zack  06901       1
1  Zack  06901       1
2  Liza  10001       2
3  Liza  10001       2
4  John  50307       3
5  John  50307       3
6  John  50307       3

### Find duplicates

In [3]:
df_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

### Drop duplicates

In [4]:
df_obj.drop_duplicates()

   Name    Zip  Number
0  Zack  06901       1
2  Liza  10001       2
4  John  50307       3

In [5]:
# for example with columns let's create a new dataframe
df_obj_columns = DataFrame(
    {
        'Name': ['Zack', 'Zack', 'Liza', 'Liza', 'John', 'John', 'John'],
        'Zip': ['06901', '06901', '10001', '10001', '50307', '50307', '50307'],
        'Number': [1, 1, 2, 2, 3, 4, 3]
    }
)
df_obj_columns

   Name    Zip  Number
0  Zack  06901       1
1  Zack  06901       1
2  Liza  10001       2
3  Liza  10001       2
4  John  50307       3
5  John  50307       4
6  John  50307       3

In [6]:
df_obj_columns.drop_duplicates(['Number'])

   Name    Zip  Number
0  Zack  06901       1
2  Liza  10001       2
4  John  50307       3
5  John  50307       4